# abs() 取绝对值

##################################################################################################

# all()，any() 函数
n = all([1,2,3]) # 所有传入all()函数的元素都为真就为真，all()函数就返回 True
print(n)

nn = all([0,1,2]) # 所有传入all()函数的元素有一个为假，比如这里的 0 ，all()函数就返回 False
print(nn)

nnn = any([0,1,2]) # 只要有一个元素为真，any()函数就返回 True
print(nnn)


##################################################################################################

# bin()函数接受10进制数转为二进制
# oct()函数接受10进制数转为八进制
# hex()函数接受10进制数转为十六进制

print(bin(5))
print(oct(5))
print(hex(5))


##################################################################################################

# bytes() 函数, 将字符串转化为字节。 str() 将字节转化为字符串

# utf-8 编码，一个汉字占 3 个字节
# gbk编码，一个汉字占 2 个字节

## utf-8
s = "你好"
s1 = bytes(s, encoding="utf8")
print(s1) # 输出：\xe4\xbd\xa0\xe5\xa5\xbd 刚好 6 个字节

print(str(s1, encoding="utf8"))

## gbk
ss = "你好"
ss1 = bytes(ss, encoding="gbk")
print(ss1) # 输出：\xc4\xe3\xba\xc3 刚好 4 个字节

print(str(ss1, encoding="gbk"))



##################################################################################################





