# abs() 取绝对值

##################################################################################################

# all()，any() 函数
n = all([1,2,3]) # 所有传入all()函数的元素都为真就为真，all()函数就返回 True
print(n)

nn = all([0,1,2]) # 所有传入all()函数的元素有一个为假，比如这里的 0 ，all()函数就返回 False
print(nn)

nnn = any([0,1,2]) # 只要有一个元素为真，any()函数就返回 True
print(nnn)


##################################################################################################

# bin()函数接受10进制数转为二进制
# oct()函数接受10进制数转为八进制
# hex()函数接受10进制数转为十六进制

print(bin(5))
print(oct(5))
print(hex(5))


##################################################################################################

# 



